
"bottom"
"large"
"blue"
"ball"
"next-to"
"centre"
"cube"
"blue"
"small"
"next-to"
"left"
"cube"
"blue"
"large"
"bellow-of"
"left"
"ball"
"green"
"small"
"above"
"small"
"cube"
"green"
"next-to"
"small"
"ball"
"blue"
"next-to"
"large"
"ball"
"green"
"terminal"
"large"
"blue"
"ball"
"on-top"
"cube"
"blue"
"small"
"above-of"
"ball"
"green"
"small"
"above-of"
"cube"
"blue"
"large"
"small"
"cube"
"green"
"on-top"
"small"
"ball"
"blue"
"next-to"
"large"
"ball"
"green"
"next-to"
"terminal"
"large"
"green"
"ball"
"next-to"
"cube"
"blue"
"small"
"next-to"
"cube"
"blue"
"large"
"next-to"
"next-to"
"cube"
"green"
"large"
"large"
"ball"
"blue"
"large"
"cube"
"green"
"above-of"
"ball"
"blue"
"on-top"
"terminal"
"large"
"green"
"ball"
"on-top"
"cube"
"blue"
"small"
"above-of"
"small"
"blue"
"ball"
"next-to"
"next-to"
"cube"
"green"
"large"
"large"
"ball"
"blue"
"large"
"cube"
"blue"
"above-of"
"large"
"cube"
"blue"
"on-top"
"terminal"
"large"
"blue"
"ball"
"next-to"
"cube"
"blue"
"large"
"next-of"
"small"
"green"
"cube"
"next-to"
"next-to"
"cube"
"blue"
"small"
"cube"
"green"
"above-of"
"small"
"ball"
"blue"
"on-top"
"ball"
"green"
"terminal"
"centre"
"bottom"
"small"
"green"
"ball"
"next-to"
"centre"
"cube"
"blue"
"large"
"next-to"
"left"
"cube"
"green"
"large"
"left-of"
"ball"
"blue"
"small"
"small"
"cube"
"blue"
"next-to"
"small"
"cube"
"green"
"next-to"
"large"
"ball"
"blue"
"terminal"
"big"
"green"
"ball"
"next-to"
"centre"
"cube"
"blue"
"large"
"next-to"
"left"
"cube"
"blue"
"small"
"next-to"
"cube"
"green"
"small"
"next-to"
"next-to"
"small"
"cube"
"green"
"small"
"ball"
"blue"
"on-top"
"medium"
"ball"
"blue"
"terminal"
"large"
"green"
"ball"
"on-top"
"cube"
"blue"
"large"
"above-of"
"small"
"blue"
"cube"
"above-of"
"on-top"
"cube"
"green"
"small"
"ball"
"blue"
"next-of"
"small"
"cube"
"green"
"next-of"
"ball"
"blue"
"right"
"terminal"
"bottom"
"small"
"green"
"ball"
"next-to"
"centre"
"cube"
"blue"
"small"
"next-to"
"left"
"cube"
"blue"
"large"
"bellow-of"
"left"
"ball"
"green"
"large"
"above"
"small"
"cube"
"green"
"next-to"
"small"
"ball"
"blue"
"next-to"
"large"
"ball"
"blue"
"terminal"
"small"
"green"
"ball"
"on-top"
"cube"
"blue"
"large"
"above-of"
"ball"
"blue"
"small"
"next-to"
"cube"
"green"
"small"
"large"
"ball"
"blue"
"next-to"
"large"
"cube"
"green"
"above-of"
"small"
"cube"
"blue"
"on-top"
"terminal"
"small"
"blue"
"ball"
"next-to"
"cube"
"blue"
"large"
"next-to"
"cube"
"blue"
"small"
"next-to"
"next-to"
"cube"
"green"
"small"
"small"
"cube"
"blue"
"above-of"
"small"
"ball"
"green"
"on-top"
"large"
"ball"
"green"
"terminal"
"small"
"blue"
"ball"
"on-top"
"cube"
"blue"
"large"
"above-of"
"cube"
"green"
"small"
"above-of"
"on-top"
"cube"
"blue"
"small"
"small"
"ball"
"green"
"next-to"
"small"
"cube"
"blue"
"next-to"
"large"
"ball"
"green"
"terminal"
